In [1]:
import pandas as pd
from IPython.display import display
import numpy as np

Pandas is a package built using numpy used for data analysis and manipulation.

In [2]:
# Column Name : Array compatible list of Values
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Delhi', 'Mumbai', 'Bangalore']
}
df = pd.DataFrame(data)
display(df)

      Name  Age       City
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

1. Load data from CSV

In [3]:
df = pd.read_csv("data.csv")
display(df)

  Customer ID First Name Last Name                 Email ID    Phone Number
0     CUST001       Amit    Sharma  amit.sharma@example.com  +91-9876543210
1     CUST002      Priya     Mehra  priya.mehra@example.com  +91-9123456789
2     CUST003      Rahul     Verma  rahul.verma@example.com  +91-9988776655
3     CUST004      Sneha      Nair   sneha.nair@example.com  +91-9090909090
4     CUST005      Karan     Patel  karan.patel@example.com  +91-9871234567

In [4]:
pd.read_excel
pd.read_json
pd.read_html
pd.read_sql  # compatible with SQLAlchemy
pd.read_xml

<function pandas.io.xml.read_xml(path_or_buffer: 'FilePath | ReadBuffer[bytes] | ReadBuffer[str]', *, xpath: 'str' = './*', namespaces: 'dict[str, str] | None' = None, elems_only: 'bool' = False, attrs_only: 'bool' = False, names: 'Sequence[str] | None' = None, dtype: 'DtypeArg | None' = None, converters: 'ConvertersArg | None' = None, parse_dates: 'ParseDatesArg | None' = None, encoding: 'str | None' = 'utf-8', parser: 'XMLParsers' = 'lxml', stylesheet: 'FilePath | ReadBuffer[bytes] | ReadBuffer[str] | None' = None, iterparse: 'dict[str, list[str]] | None' = None, compression: 'CompressionOptions' = 'infer', storage_options: 'StorageOptions | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>) -> 'DataFrame'>

2. Inspect

In [5]:
display(df.head(3))

  Customer ID First Name Last Name                 Email ID    Phone Number
0     CUST001       Amit    Sharma  amit.sharma@example.com  +91-9876543210
1     CUST002      Priya     Mehra  priya.mehra@example.com  +91-9123456789
2     CUST003      Rahul     Verma  rahul.verma@example.com  +91-9988776655

In [6]:
display(df.tail(3))

  Customer ID First Name Last Name                 Email ID    Phone Number
2     CUST003      Rahul     Verma  rahul.verma@example.com  +91-9988776655
3     CUST004      Sneha      Nair   sneha.nair@example.com  +91-9090909090
4     CUST005      Karan     Patel  karan.patel@example.com  +91-9871234567

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Customer ID   5 non-null      object
 1   First Name    5 non-null      object
 2   Last Name     5 non-null      object
 3   Email ID      5 non-null      object
 4   Phone Number  5 non-null      object
dtypes: object(5)
memory usage: 332.0+ bytes

In [8]:
print(f"Shape = {df.shape}")
print(f"Size = {df.size}")

Shape = (5, 5)
Size = 25

3. describe()

In [9]:
display(df.describe())

,Customer ID,First Name,Last Name,Email ID,Phone Number
count,5,5,5,5,5
unique,5,5,5,5,5
top,CUST001,Amit,Sharma,amit.sharma@example.com,+91-9876543210
freq,1,1,1,1,1

4. Access Columns & Rows

In [10]:
print(df["Customer ID"])

0    CUST001
1    CUST002
2    CUST003
3    CUST004
4    CUST005
Name: Customer ID, dtype: object

In [11]:
print(df[["Customer ID", "First Name"]])

  Customer ID First Name
0     CUST001       Amit
1     CUST002      Priya
2     CUST003      Rahul
3     CUST004      Sneha
4     CUST005      Karan

4A. iloc slicing

In [12]:
# index based slicing
df.iloc[0, :] # First Row

Customer ID                     CUST001
First Name                         Amit
Last Name                        Sharma
Email ID        amit.sharma@example.com
Phone Number             +91-9876543210
Name: 0, dtype: object

In [13]:
df.iloc[[0, 2], :] # Rows 1 and 3

  Customer ID First Name Last Name                 Email ID    Phone Number
0     CUST001       Amit    Sharma  amit.sharma@example.com  +91-9876543210
2     CUST003      Rahul     Verma  rahul.verma@example.com  +91-9988776655

In [14]:
df.iloc[: ,[1, 2]]  # Columns 2, 3

  First Name Last Name
0       Amit    Sharma
1      Priya     Mehra
2      Rahul     Verma
3      Sneha      Nair
4      Karan     Patel

4B. loc slicing

In [15]:
# Slicing with column names
df.loc[:, "First Name"]

0     Amit
1    Priya
2    Rahul
3    Sneha
4    Karan
Name: First Name, dtype: object

In [16]:
df.loc[0:3, ["First Name", "Last Name"]]

  First Name Last Name
0       Amit    Sharma
1      Priya     Mehra
2      Rahul     Verma
3      Sneha      Nair

5. Masking (Filtering)

In [17]:
# add an age column
df["Age"] = np.random.randint(low=18, high=65, size=df["Customer ID"].size)
display(df)

,Customer ID,First Name,Last Name,Email ID,Phone Number,Age
0,CUST001,Amit,Sharma,amit.sharma@example.com,+91-9876543210,22
1,CUST002,Priya,Mehra,priya.mehra@example.com,+91-9123456789,26
2,CUST003,Rahul,Verma,rahul.verma@example.com,+91-9988776655,60
3,CUST004,Sneha,Nair,sneha.nair@example.com,+91-9090909090,45
4,CUST005,Karan,Patel,karan.patel@example.com,+91-9871234567,52

In [18]:
mask = df["Age"] > 45
mask

0    False
1    False
2     True
3    False
4     True
Name: Age, dtype: bool

In [19]:
display(df[mask])  # masked rows

,Customer ID,First Name,Last Name,Email ID,Phone Number,Age
2,CUST003,Rahul,Verma,rahul.verma@example.com,+91-9988776655,60
4,CUST005,Karan,Patel,karan.patel@example.com,+91-9871234567,52

In [20]:
display (df[~mask])  # unmasked

,Customer ID,First Name,Last Name,Email ID,Phone Number,Age
0,CUST001,Amit,Sharma,amit.sharma@example.com,+91-9876543210,22
1,CUST002,Priya,Mehra,priya.mehra@example.com,+91-9123456789,26
3,CUST004,Sneha,Nair,sneha.nair@example.com,+91-9090909090,45

6. Apply

In [21]:
def isSenior(age: int):
    if age > 60:
        return True
    return False

df['Senior Citizen'] = df['Age'].apply(isSenior)
display(df)

,Customer ID,First Name,Last Name,Email ID,Phone Number,Age,Senior Citizen
0,CUST001,Amit,Sharma,amit.sharma@example.com,+91-9876543210,22,False
1,CUST002,Priya,Mehra,priya.mehra@example.com,+91-9123456789,26,False
2,CUST003,Rahul,Verma,rahul.verma@example.com,+91-9988776655,60,False
3,CUST004,Sneha,Nair,sneha.nair@example.com,+91-9090909090,45,False
4,CUST005,Karan,Patel,karan.patel@example.com,+91-9871234567,52,False

7. Sorting

In [22]:
display(df.sort_values(["Age"], ascending=False))

,Customer ID,First Name,Last Name,Email ID,Phone Number,Age,Senior Citizen
2,CUST003,Rahul,Verma,rahul.verma@example.com,+91-9988776655,60,False
4,CUST005,Karan,Patel,karan.patel@example.com,+91-9871234567,52,False
3,CUST004,Sneha,Nair,sneha.nair@example.com,+91-9090909090,45,False
1,CUST002,Priya,Mehra,priya.mehra@example.com,+91-9123456789,26,False
0,CUST001,Amit,Sharma,amit.sharma@example.com,+91-9876543210,22,False

8. Delete Columns

In [23]:
df = df.drop(columns=["Email ID"])
display(df)

  Customer ID First Name Last Name    Phone Number  Age  Senior Citizen
0     CUST001       Amit    Sharma  +91-9876543210   22           False
1     CUST002      Priya     Mehra  +91-9123456789   26           False
2     CUST003      Rahul     Verma  +91-9988776655   60           False
3     CUST004      Sneha      Nair  +91-9090909090   45           False
4     CUST005      Karan     Patel  +91-9871234567   52           False